setScreenMetrics(1080, 1920);

function a1() {
  press(795, 192, 1);
}
function a2() {
  press(966, 172, 1);
}
function a3() {
  press(1160, 184, 1);
}
function a4() {
  press(790, 353, 1);
}
function a5() {
  press(969, 344, 1);
}
function a6() {
  press(1143, 356, 1);
}
function a7() {
  press(777, 557, 1);
}
function a8() {
  press(980, 539, 1);
}
function a9() {
  press(1163, 536, 1);
}
function t() {
  sleep(200);
}
// 5 times
a4(); t(); a6(); t(); a2(); t(); a8(); t(); a3(); t(); a4(); t();
a4(); t(); a6(); t(); a2(); t(); a8(); t(); a3(); t(); a4(); t();
a4(); t(); a6(); t(); a2(); t(); a8(); t(); a3(); t(); a4(); t();
a4(); t(); a6(); t(); a2(); t(); a8(); t(); a3(); t(); a4(); t();
a4(); t(); a6(); t(); a2(); t(); a8(); t(); a3(); t(); a4(); t();

// 小星星 438264
// 大星星 462834
// 爱心 153684
// nmsl 71593
//      72839
// 	 2468
// 	 179
// sb 2468
//    28965
// 大爱心 974523
// 小爱心 25479

// 795 192
// 966 172
// 1160 184

// 790 353
// 969 344
// 1143 356

// 777 557
// 980 539
// 1163 536